Revit 2026 API

# BuiltInFailuresElectricityFailures Class

---

Failures related to electrical system and circuits.

SystemObject Autodesk.Revit.DBBuiltInFailuresElectricityFailures

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static class ElectricityFailures
```
```vb
Public NotInheritable Class ElectricityFailures
```
```cpp
public ref class ElectricityFailures abstract sealed
```
```fsharp
[<AbstractClassAttribute>]
[<SealedAttribute>]
type ElectricityFailures = class end
```

The BuiltInFailuresElectricityFailures type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | FamilyMismatchCircuitDisconnected | The family no longer matches the properties for the Circuit. Disconnect the family from the Circuit? |
|  | InvalidPoleNumber | The panel is single phase [wire] wires. The number of poles can not be larger than [value]. |
|  | InvalidPoleNumberInIsolatedPanel | The panel is an isolated panel. The number of poles should equal to [value]. |
|  | InvalidSpareLoad | The spare/space assigned to panel '[Panel Name]' has an invalid load property. To correct this issue, remove and add the spare/space to the panel again. |

#### Reference

Autodesk.Revit.DB Namespace